---
kind: type
id: T:Autodesk.Revit.DB.TagOrientation
source: html/0f1faf70-46a4-71a1-63c0-3425dfc691a0.htm
---
# Autodesk.Revit.DB.TagOrientation

An enumerated type listing tag orientation options that are supported by IndependentTags.

## Syntax (C#)
```csharp
public enum TagOrientation
```